TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/гкс_ФормированиеНомераПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ФормированиеНомераПробы</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>CatalogRef.гкс_НомерПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСуткиРегистрации</name>
    <comment>ERP-1431</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СопоставлениеФНПЛабАнализа/гкс_СопоставлениеФНПЛабАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СопоставлениеФНПЛабАнализа</name>
  <resources>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </resources>
  <resources>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </resources>
  <resources>
    <name>НазначениеИспользования</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </resources>
  <resources>
    <name>УсиленныйКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФормированиеНомераПробы</name>
    <type>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_НомерПробы/гкс_НомерПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_НомерПробы</name>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапретИзмененияДокументаПоРеестру(Отказ) Тогда		
       Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДозаполнитьРеквизитыОбъекта();
	СформироватьНомерПробыПоНеобходимости();
	
	ЗарегистрироватьТранспортноеСредствоДляУсиленногоКонтроля(Отказ, РежимЗаписи);
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ДополнительныеСвойства = Новый Структура;
	
	ЭтоУсиленныйКонтрольДляТС = Ложь;
	Если ДополнительныеСвойства.Свойство("ЭтоУсиленныйКонтрольДляТС") Тогда
		ЭтоУсиленныйКонтрольДляТС = ДополнительныеСвойства.ЭтоУсиленныйКонтрольДляТС;
	КонецЕсли;

	ЗаполнитьДопПараметры(ДопПараметры, "ЭтоУсиленныйКонтрольДляТС", ЭтоУсиленныйКонтрольДляТС);		
	ЗаполнитьДопПараметры(ДопПараметры,"ТипПробы", ТипПробы);
	
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры);
	
	ПараметрыСозданияАнализа = Неопределено;
	ДополнительныеСвойства.Свойство("ПараметрыСозданияАнализа", ПараметрыСозданияАнализа);
	 
	Если Не Отказ Тогда
		
		Если ПараметрыСозданияАнализа = Неопределено Тогда
			ПараметрыСозданияАнализа = Новый Структура;
		КонецЕсли;
				
		Документы.гкс_ФормированиеНомераПробы.СформироватьЛабораторныйАнализПоНеобходимости(Ссылка, ТипПробы, 
			ПараметрыСозданияАнализа);
			
		СозданныйЛабАнализ = Неопределено;
		ПараметрыСозданияАнализа.Свойство("СозданныйЛабораторныйАнализ", СозданныйЛабАнализ);
		ЗаписатьСопоставлениеФНПИЛабАнализа(СозданныйЛабАнализ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("ДокументРегистрации") Тогда
			
			СтрокаРегистрация = СписокРегистраций.Добавить();
			СтрокаРегистрация.ДокументРегистрации = ДанныеЗаполнения.ДокументРегистрации;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("ТаблицаРегистраций") Тогда
			
			Для Каждого СтрокаТаблицы Из ДанныеЗаполнения.ТаблицаРегистраций Цикл
				СтрокаРегистрация = СписокРегистраций.Добавить();
				СтрокаРегистрация.ДокументРегистрации = СтрокаТаблицы.ДокументРегистрации;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Есть показатели усиленного контроля.
// 
// Параметры:
//  ДокументРегистрации Документ регистрации
// 
// Возвращаемое значение:
//  Булево - Есть показатели усиленного контроля
Функция ЕстьПоказателиУсиленногоКонтроля(ДокументРегистрации)
	
	// Проверяем заполненность документа регистрации
	Если НЕ ЗначениеЗаполнено(ДокументРегистрации) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат гкс_ВходнойКонтрольКачества.ПроверитьПоказателиУсиленногоКонтроляПоРегистрации(ДокументРегистрации);

КонецФункции

// ТСЗаблокировано для разгрузки.
// 
// Параметры: ТранспортноеСредство Транспортное средство
//  ДокументРегистрации - СправочникСсылка.ТранспортныеСредства - Документ регистрации
// 
// Возвращаемое значение:
//  Булево - ТСЗаблокировано для разгрузки
Функция ТСЗаблокированоДляРазгрузки(ДокументРегистрации)
	
	// Проверяем заполненность документа
	Если НЕ ЗначениеЗаполнено(ДокументРегистрации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат гкс_ВходнойКонтрольКачества.ПроверитьБлокированиеТранспортногоСредстваДляРазгрузки(ДокументРегистрации);

КонецФункции

Процедура ЗаполнитьДопПараметры(ДопПараметры, ИмяДопРеквизита, ЗначениеДопРеквизита)
	
	ДопПараметры.ДополнительныеСвойства.Вставить(ИмяДопРеквизита, ЗначениеДопРеквизита);
	
КонецПроцедуры

Процедура ДозаполнитьРеквизитыОбъекта()
	
	ЗаполнитьОрганизациюВСпискеРегистраций();
	
	Если ЭтоНовый() Тогда
		Если ТипПробы = Перечисления.гкс_ТипыПроб.Композитная И СписокРегистраций.Количество() > 0 Тогда
			ЗаполнятьДатыПоРегистрацииПЛК();
		Иначе
			ЗаполнитьМестноеВремя();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОрганизациюВСпискеРегистраций()
	
	НужноЗаполнятьОрганизацию = Ложь;
	Для Каждого СтрокаРегистрации Из СписокРегистраций Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаРегистрации.Организация) Тогда
			НужноЗаполнятьОрганизацию = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ НужноЗаполнятьОрганизацию Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыРегистраций = 
	ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокРегистраций.ВыгрузитьКолонку("ДокументРегистрации"), "Организация");
		
	Для Каждого СтрокаРегистрации Из СписокРегистраций Цикл
		
		Если ЗначениеЗаполнено(СтрокаРегистрации.Организация) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРегистрации.Организация = РеквизитыРегистраций[СтрокаРегистрации.ДокументРегистрации];		
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьМестноеВремя()
	
	Если ЗначениеЗаполнено(МестнаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	ЧасовойПоясТочки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаМаршрута, "гкс_ЧасовойПоясТочкиМаршрута");
		
	Если ЗначениеЗаполнено(ЧасовойПоясТочки) Тогда
		МестнаяДата = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПоясТочки);			
	Иначе
		МестнаяДата = Дата;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнятьДатыПоРегистрацииПЛК()

	РегистрацияПЛК = ПервыйДокументИзСпискаРегистраций();
	Если ЗначениеЗаполнено(РегистрацияПЛК) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РегистрацияПЛК, "Дата, МестнаяДата");
	КонецЕсли;	

КонецПроцедуры

Функция ЗапретИзмененияДокументаПоРеестру(Отказ)
	
	Если гкс_ПриемкаТранспорта.ЗапретИзмененияДокументаПоРеестру(Ссылка) Тогда		
		Отказ = Истина;
		ИмяСобытия = НСтр("ru = 'Запрет изменения документа'");
		ТекстШаблона = НСтр("ru = 'Не удалось записать документ: %1 т.к. уже оформлен реестр ЗПП-3'");
				
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.гкс_ФормированиеНомераПробы, 
			Ссылка, СтрШаблон(ТекстШаблона, Ссылка));

		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
   
КонецФункции

#Область НомераПроб

Процедура СформироватьНомерПробыПоНеобходимости()
	
	Если ЗначениеЗаполнено(НомерПробы) Тогда
		Возврат;
	КонецЕсли;
	
	НомерПробыОбъект = Справочники.гкс_НомерПробы.СоздатьЭлемент();
	НомерПробыОбъект.Заполнить(ДанныеЗаполненияДляНомераПробы());
	
	Попытка 
		НомерПробыОбъект.Записать();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	НомерПробы = НомерПробыОбъект.Ссылка;
	
КонецПроцедуры

Функция ДанныеЗаполненияДляНомераПробы()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ТипПробы", ТипПробы);
	
	Если ТипПробы = Перечисления.гкс_ТипыПроб.Единичная И СписокРегистраций.Количество() > 0 Тогда
	
		Регистрация = ПервыйДокументИзСпискаРегистраций();
		ДанныеЗаполнения.Вставить("Регистрация", Регистрация);
	
	Иначе
		ДанныеЗаполнения.Вставить("Регистрация", СписокРегистраций.ВыгрузитьКолонку("ДокументРегистрации"));		
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ПервыйДокументИзСпискаРегистраций()
	
	Результат = Неопределено;
	
	Если СписокРегистраций.Количество() > 0 Тогда
		Результат = СписокРегистраций[0].ДокументРегистрации;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции	

#КонецОбласти 

Процедура ЗарегистрироватьТранспортноеСредствоДляУсиленногоКонтроля(Отказ, РежимЗаписи)
	
	Если Не (ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества")
		И РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументРегистрации = ПолучитьДокументРегистрации();
		
	Если ТребуетсяРегистрацияДляУсиленногоКонтроля(ДокументРегистрации) Тогда
		
		гкс_ВходнойКонтрольКачества.
			ЗарегистрироватьТранспортноеСредствоДляУсиленногоКонтроля(ДокументРегистрации, МестнаяДата);			
	КонецЕсли;	
		
КонецПроцедуры            

Функция ПолучитьДокументРегистрации()
	
	Если СписокРегистраций.Количество() = 0 Тогда
		Регистрация = Документы.гкс_РегистрацияНаПЛК.ПустаяСсылка();
	Иначе
		Регистрация = СписокРегистраций[0].ДокументРегистрации;
	КонецЕсли;
	
	Возврат Регистрация;
	
КонецФункции	
	
Функция ТребуетсяРегистрацияДляУсиленногоКонтроля(ДокументРегистрации)

	Если Не ЗначениеЗаполнено(ДокументРегистрации) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ТипРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ТипРегистрации");
	
	Возврат ТипПробы = Перечисления.гкс_ТипыПроб.Единичная
		И ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка;
	
КонецФункции

// Записывает сопоставление текущего документа ФНП и связанных ЛабораторныхАнализов в регистр сведений.
// Вызывается из ОбработкаПроведения после создания ЛабораторногоАнализа.
// Процедура - Записывает сопоставление ФНП и ЛабАнализа в регистр сведений
//
// Параметры:
//  ЛабораторныйАнализ - ДокументСсылка.гкс_ЛабораторныйАнализ, Неопределено - Ссылка на созданный документ
//
Процедура ЗаписатьСопоставлениеФНПИЛабАнализа(ЛабораторныйАнализ = Неопределено)

	Если Не ЗначениеЗаполнено(ЛабораторныйАнализ) Тогда
		Возврат;
	КонецЕсли;

	// Записываем сопоставление - все данные (ТипПробы, НазначениеИспользования, УсиленныйКонтроль)
	// получаются внутри функции ЗаписатьСопоставление из переданных документов
	РегистрыСведений.гкс_СопоставлениеФНПЛабАнализа.ЗаписатьСопоставление(
		Ссылка,
		ЛабораторныйАнализ);

КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
